Egoist
Egotist
Altruist
Introvert
Extrovert
Ambivert
Misanthrope
Misogynist
Misogamist
Ascetic
Egocentric
Egomaniac
Alternate
Alternative
Alter ego
Altercation
Alteration
Sinister
Ambidextrous
Perilous
Dexterity
Gauche, gaucherie
Finesse
Adroit
Austerity
Anthropology
Gynaecologist
Monogamy
Polygamy
Bigamy
Polugynous
Polyandrist
Gynaecologist
Obstetrician
Pedagogy
Pedagogue
Demagogue
Pedestal
Pedal
Pedestrian
Hypodermic
Epidemis
Taxidermy
Pachyderm
Dermatitis
Ophthalmology
Oculist
Ocular
Monocle
Binoculars
Inoculate
Optometrist
Optician
Orthopedic
Orthodontist
Cardiologist
Cardiogram
Neurology
Neuralgia
Neurosis
Neuritis
Neurotic
Psychosis
Psychotic
Psychiatric
Geriatric
Geriatrician
Nostalgia
Psychoanalyst
Osteopath
Chiropractor
Chiropodist
Graphologist
Gerontologist
Psychosomatic
Psychogenic
Psychotherapy
Periodontist
Endodontist
Exodontist
Podiatrist
Podium
Platypus
Chiromancy
Chirography
Calligraphy
Callipygian
Cacophony
Cacography
Photograph
Phonograph
Telegraph
Biograph
Geriatrician
Gerontologist
Senile
Senescent
Senior
Senate
Anthropologist
Astronomer
Astrology
Geologist
Astronaut
Cosmonaut
Aster
Asterisk
Astrophysics
Disaster
Geography
Autopsy
Biopsy
Botanist
Zodiac
Tonsillectomy
Appendectomy
Mastectomy
Hysterectomy
Prostatectomy
Eccentric
Atom
Anatomy
Tome
Dichotomy
Epitome
Philology
Philanderer
Philosophy
Philadelphia
Philharmonic
Philtre
Aphrodisiac
Bibliophile
Anglophile
Social
Asocial
Associate
Society
Semantics
Notorious
Congenital
Consummate
Inveterate
Glib
Incorrigible
Pathological
Unconscienable
Egregious
Chronic
Childish
Childlike
Veteran
Psychogenic
Genetics
Genealogy
Genital
Congenital
Hereditary
Anachronism/anachronous
Incongruous
Chronological
Chronometer
Synchronize
Pathology
Sympathy
Empathy
Antipathy
Apathy
Pathetic
Telepathy
Conscience
Conscious
Science
Omniscient
Prescient
Nescient
Glib
Gregarious
Congregate
Segregate
Aggregate
Sphygmomanometer
Podiatrist

par
parity
disparity
disparagement
compare
equivocate
unequivocal
ambiguous
double entendre

Equity
Inequity
Iniquity
Equinox
Nocturnal
Nocturne
equanimity
Equable
Equilibrium
Equilibrist
Equation
Equilateral
Equivalent
Equidistant
Equestrian
Equestrienne
Equine
Equivocal
Vociferous
Vocal
Vocalize

Titillate
compliment
flattery
adulation
proscribe
scribe
scribble
prescribe
describe
subscribe
script
typescript
manuscript

obviate
trivial
militate
malign
malignant
malediction
malevolent
maleficent
malefactor
maladroit
malaise
malicious
malice
malady
maladjusted
malcontent
malpractice
malnutrition
benign/benignity
benediction
beneficent
benefactor
beneficiary
benefit
benevolent
bonbon
bona fide
fido
infidel
fidelity
infidelity

dictate/dictator
dictaphone
contradict
addiction
factory/fiction/manufacture
artificial

voluntary/volunteer
volition

placate
implacable
pacid
complacent
condone
donate/donation
magnanimous
confectionery
malaria

taciturn/taciturnity
laconic
inarticulate
garrulous
banal
verbose
voluble
cogent
vociferous
loquacious

tacit
reticent
soliloquy
colloquial
colloquialism
ventriloquist
elocution
circumlocution

auricle
ventricle
avuncular
dorsal
endorse
vociferous
somniferous
insomnia
somnolent
somnambulism
ambulatory
perambulator
amble
preamble
ambulance

soparific
inarticulate
banality



Euphemism
Dessicate
Endemic
Idiosyncrasy

Vim
Kindle
Molt
Antipathy

Ossify
Attenuate
Solecism
Potentate

Aggregate
Abstemious
Castigation
Paradox

Intrepid
Implaccable
Sully
Inert

Mar
Flout
Multifarious
Lumber

Demur
Debutante
Propitiate
Toady

Bombastic
Impermeable
Jargon
Sardonic

Monastic
Dyspeptic
Assuage
Pervade

Vernal
Recondite
Quiescent
Coagulate

2

Archaic
Innocuous
Subponea
Quibble

Parley
Decorum
Gouge
Lucid

Derivative
Husband
Solicitous
Monotony

Placate
Confound
Peripatetic
Turgid

Obstinate
Diaphanous
Puerile
Precis

Pathogenic
Venerable
Dilatory
Admonish

Lachrymose


// { KINDLE

exhilarate
human
pleasure
salivate
scarcely
immensity
surmount
everything
idea
phrenology
old wives' tale
according
banal
fortitude
tenacity
bravado
the
but
I
culture
in-group
with
imagine
privileged
unfetter
like
amygdala
when
grit
yearn
parable
do
kaizen
mural
epiphany
swoon
paragon
fraternal
ON
stipple
these
are
unbeknownst
assiduousness
precocious
boot camp
dogged
tap
reveille
grit
rehash
apropos
vacant
disconcert
pump
complaisant
prudently
pageantry
depose
phlegmatically
sound
cavalier
stir
prosaic
vicissitude
mellow
strident
unrelieved
legalistically
glorious
energy
hurl
jugular vein
jugular
debarkation
lump
imperial
psychohistory
hydroponic
vivisection
compunction
extraneous
irresolute
belabor
catechism
ungulate
apprehension
IF
snobbishness
reconcile
maraschino
cajolery
consternation
rigmarole
prosaically
creed
haul
ragged
truculently
claustrophobia
curl
untenable
smack
exasperation
peevishly
hamper
sternly
cockeyed
derision
humor
mythology
antipodes
aphelion
ruddy
peremptorily
clasp
phraseology
interpose
impudent
syndicate
belligerent
sandbag
thing
vesting
unscrupulous
Uzi
term
angel
venture capitalist
megalomaniac
fledgling
flounder
banality
senility
Proxima Centauri
special theory of relativity
absolute
view
than
quantum mechanics
general theory of relativity
compelling
antinomy
publish
Ptolemy
North Star
eclipse
apocryphal
hull
fleeting
abdicate
spirit
vicissitude
languish
vindictive
obnoxious
serendipitous
rambunctious
Copernicus
inadvertently
diligence
belligerently
sausage
tenement
barn
wryly
welter
jail
tart
not
pugnacious
anguished
suddenly
meeting
caravanserai
harbour
ryot
accede
and
scowl
little
morosely
stilted
sling
be
slung
shapeless
skitter
mottle
sycamore
recumbent
juncture

// KINDLE }
